<template>
    <div class="AgreementUp">
        <el-dialog :visible.sync="isTosignupsuc" width="380px" top='16vh' :modal='false' :close-on-click-modal="false">
            <p>{{agreementNmae}}</p>
            <div class="main-content">
                <span>用户协议
欢迎您与pk8电竞（详见定义条款）共同签署本《用户注册协议》（下称“本协议”）并使用pk8电竞服务！ 各条款标题仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。
<br />【审慎阅读】您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的条款、法律适用和争议解决条款。免除或限制责任的条款将以粗体下划线标识，您应重点阅读。若您对协议有任何疑问，可向pk8电竞客服咨询。
<br />【签约动作】当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与pk8电竞达成一致，成为pk8电竞 “用户”。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
<br />如果您未申请注册流程，或者在本协议生效前已成为pk8电竞的注册用户，则您通过访问和/或使用pk8电竞，即视为您表示同意接受本协议的全部内容，否则请您不要访问或使用pk8电竞。
<br />1、 定义
<br />pk8电竞：指pk8电竞客户端和pk8电竞官方网站。
<br />pk8电竞服务：pk8电竞基于互联网，以包含pk8电竞网站、客户端等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。
<br />pk8电竞规则：包括在所有pk8电竞网站内已经发布及后续发布的全部规则、解读、公告等内容以及pk8电竞各频道、活动页面等发布的各类规则、实施细则、产品说明、公告等。
<br />用户：下称“您”或“用户”，是指注册、登录、使用、浏览、获取本协议项下服务的个人或组织。
<br />2、协议范围
<br />2.1签约主体
<br />本协议是您与pk8电竞之间关于注册、登录pk8电竞以及使用pk8电竞服务所订立的协议。本协议对您与pk8电竞经营者均具有合同效力。
<br />pk8电竞经营者是指经营pk8电竞的各法律主体。本协议项下，pk8电竞经营者可能根据pk8电竞的业务调整而发生变更，变更后的pk8电竞经营者与您共同履行本协议并向您提供服务，pk8电竞经营者的变更不会影响您本协议项下的权益。pk8电竞经营者还有可能因为提供新的pk8电竞服务而新增，如您使用新增的pk8电竞服务的，视为您同意新增的pk8电竞经营者与您共同履行本协议。发生争议时，您可根据您具体使用的服务及对您权益产生影响的具体行为对象确定与您履约的主体及争议相对方。
<br />2.2补充协议
<br />由于互联网高速发展，您与pk8电竞签署的本协议列明的条款并不能完整罗列并覆盖您与pk8电竞所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，pk8电竞公示的相关声明及政策、pk8电竞规则和协议均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用pk8电竞服务，视为您同意上述补充协议。
<br />2、 账户注册与使用
<br />3.1用户资格
<br />您确认，在您开始使用/注册程序使用pk8电竞服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
特别地，如果您是未成年人，请在您的监护人的陪同下审阅和接受本协议。未成年人应当在合理程度内使用pk8电竞台，不得因使用pk8电竞而影响了日常的学习生活。您理解pk8电竞无义务对本款前述事项进行任何形式的审查和确认。
<br />3.2账户说明
当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得pk8电竞账户并成为pk8电竞用户。
您有权使用您设置或确认的pk8电竞户名（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录pk8电竞。
由于您的pk8电竞账户关联您的个人信息及pk8电竞商业信息，您的pk8电竞账户仅限您本人使用。未经pk8电竞同意，您直接或间接授权第三方使用pk8电竞账户或获取您账户项下信息的行为所导致的一切责任后果由您自行承担，pk8电竞对此不承担任何责任。但如若pk8电竞判断您pk8电竞账户的使用可能危及您的账户安全及/或pk8电竞信息安全的，pk8电竞可拒绝提供相应服务或终止本协议。
由于用户账户关联用户信用信息，仅当有法律明文规定、司法裁定或经pk8电竞同意，并符合pk8电竞规则规定的用户账户转让流程的情况下，您可进行账户的转让。您的账户一经转让，该账户项下权利义务一并转移。除此外，您的账户不得以任何方式转让，否则由此产生的一切责任均由您承担。
作为pk8电竞经营者，为使您更好地使用pk8电竞的各项服务，保障您的账户安全，pk8电竞可要求您按pk8电竞要求及我国法律规定完成实名认证。
如您的账户长期未登录，pk8电竞有权予以进行冻结、注销、回收、替换或采取删除该用您账户在pk8电竞数据库中的任何记录（包括但不限于登录信息等）等清理措施，相应服务同时终止。pk8电竞在对此类账户进行清理前，将以包括但不限于弹窗、网站公告、站内消息、客户端推送信息等方式通知您。
<br />3.3注册信息管理
<br />3.3.1真实合法
您所设置的账户名不得违反国家法律法规及pk8电竞规则关于账户名的管理规定，否则pk8电竞可对您的账户名进行暂停使用等处理，并向主管机关报告。 您理解并承诺，您的账户名称、头像和简介等注册信息中不得出现违法和不良信息，没有冒用、关联机构或社会名人，您在账户登录过程中需遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线。
如平台发现您在软件中注册或使用的账号等一切自定义名称与其他用户相同而导致无法识别，pk8电竞有权要求您修改上述名称，如您在pk8电竞要求的时限内未予修改，则pk8电竞有权在您自定义的名称后加注识别符号予以区别以确保软件正常运行（例如您希望或正在使用的账户名称为“pk8电竞”，但在同一组服务器中同样存在另外一个用户账户名为“pk8电竞”，则在您不愿意修改名称的情况下，pk8电竞有权不经您同意的情况在您名称后加注识别符号后成为“pk8电竞1”、“pk8电竞2”等），您保证无条件同意上述修改 您同意并授权，为了更好的为您提供服务以及确保您的账户安全，pk8电竞可以根据您提供的手机号码、身份证号码等信息，向全国公民身份号码查询服务中心、电信运营商、金融服务机构等可靠单位发起用户身份真实性、用户征信记录、用户手机号码有效性状态等情况的查询。
<br />3.3.2 更新维护
您应当及时更新您提供的信息（包括但不限于pk8资料等），确保符合及时、详尽、真实、准确的要求。在法律有明确规定要求pk8电竞对部分用户的信息进行核实的情况下，pk8电竞将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整的信息。您在更改、删除有关信息的同时也可能会造成储存在系统中的文字、图片、视频等丢失，pk8电竞对您自主操作导致内容丢失不承担责任。
如pk8电竞按您最后一次提供的信息与您联系未果、您未按pk8电竞的要求及时提供信息、您提供的信息存在明显不实或行政司法机关核实您提供的信息无效的，您将承担因此对您自身、他人及pk8电竞造成的全部损失与不利后果。pk8电竞可向您发出询问或要求整改的通知，并要求您进行重新认证，直至中止、终止对您提供部分或全部pk8电竞服务，pk8电竞对此不承担责任。
<br />3.3.3账户安全规范
您的账户为您自行设置并由您保管，pk8电竞任何时候均不会主动要求您提供您的账户密码。因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开pk8电竞。
如您主动通知pk8电竞，要求pk8电竞采取措施暂停您账号的登录和使用的，pk8电竞台应当要求您提供并核实与其登录身份信息相一致的个人有效身份信息，否则pk8电竞有权拒绝您的上述请求。pk8电竞核实您所提供的个人有效身份信息与所登录的身份信息相一致的，应当及时采取措施暂停用户账号的登录和使用。用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与所登录的身份信息不一致的，pk8电竞有权拒绝用户上述请求。
账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，均由您自行承担。pk8电竞并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。 您的账户只限您本人使用，不得出借、赠与、出租、未按规定程序转让、售卖或分享他人使用。当您的账户遭到未经授权的使用时，您应当立即通知pk8电竞，否则未经授权的使用行为均视为您本人的行为，您将自行承担所有由此导致的损失及后果。
除pk8电竞存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等）负责。
如发现任何未经授权使用您账户登录pk8电竞或其他可能导致您账户遭窃、遗失的情况，建议您立即通知pk8电竞。您理解pk8电竞对您的任何请求采取行动均需要合理时间，且pk8电竞应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除pk8电竞存在法定过错外，平台不承担责任。
<br />4、pk8电竞服务及规范
<br />4.1pk8电竞服务
pk8电竞向您提供包括但不限于以下服务：
<br />4.1.1pk8电竞直接所有或运营的任何网站 （及其他由pk8电竞运营的任何网站）；
<br />4.1.2pk8电竞直接拥有或运营网站的客户端包括但不限于PC、平板、手机、电视、机顶盒子等全部终端的客户端；
<br />4.1.3pk8电竞用户个人中心服务；
<br />4.1.4 pk8电竞下单服务；
<br />4.1.5 pk8电竞搜索服务；
<br />4.1.6 pk8电竞提供的其他技术和/或服务（下称“其他技术和服务”）。 （以上服务统称为“pk8电竞服务”）。
pk8电竞服务，均仅限于您在pk8电竞使用，任何以恶意破解等非法手段将pk8电竞服务与pk8电竞分离的行为，均不属于本协议中约定的pk8电竞服务。由此引起的一切法律后果由行为人负责，pk8电竞将依法追究行为人的法律责任。
pk8电竞官方公布的方式为登录、下载、使用pk8电竞服务的唯一合法方式，您通过其他任何渠道、任何途径、任何方式获取的pk8电竞服务（包括但不限于账户、下载等）均为非法取得，pk8电竞概不承认其效力，且一经发现pk8电竞有权立即做出删除、取消、清零、封号等处理，任何因此导致的一切不利后果均由您自行承担，pk8电竞有权依法追究相应人员或机构的法律责任。
pk8电竞有权向您公告（包括但不限于弹出页面、网站公告、站内消息等方式）以修改、替换、升级与pk8电竞服务相关的任何软件。如果您不同意或者不接受pk8电竞服务相关软件的修改、替换、升级，请直接拒绝、停止、取消使用行为，否则视为您同意并接受pk8电竞相关软件的修改、替代、升级，同时该同意并接受的行为仍受本协议约束。
您理解并认可pk8电竞享有如下权利，pk8电竞行使如下权利不视为违约，您不追究或者豁免pk8电竞的相关法律责任：您使用pk8电竞网站或pk8电竞账户所获得的经验值、等级、关注、头衔、电子票务、虚拟房间、及奖励、下载以及pk8电竞运营过程中产生并储存于pk8电竞网络数据库的任何数据信息（包括对但不限于账户数据信息、订单数据信息、虚拟数据信息、消费数据信息等）等衍生物（下称“衍生物”），您确认对其不享有所有权（除非pk8电竞另有公告说明），pk8电竞许可您按照pk8电竞规则进行使用，pk8电竞对上述衍生物不承担任何赔偿责任。pk8电竞有权根据实际情况自行决定收回日期，无需另行通知您亦无需征得您同意。
您同意并保证，不得利用pk8电竞服务或其衍生物进行倒卖、转手、置换、抵押有价交易等方式非法牟利。您不会利用pk8电竞服务或其衍生物侵犯他人的合法权益，禁止通过网络漏洞、恶意软件或其他非法手段窃取、盗用他人的账户、平台金额等。
您理解并认可，如果您通过第三方支付工具在pk8电竞账户支付或充值购买pk8电竞的收费服务（包括但不限于购买pk8电竞内的虚拟货币的使用权以及接受其他增值服务等各类收费项目）。pk8电竞有权按需要修改或变更所提供的收费服务、收费标准、收费方式、服务费、及服务条款。pk8电竞提供服务时，可能现在或日后对部分服务的用户开始收取一定的费用，如您拒绝支付该等费用，则不能在收费开始后继续使用相关的服务。如果您通过第三方支付工具在pk8电竞账户支付或充值后可能产生的任何商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动），该等风险均有可能给您造成相应的经济损失，pk8电竞在充分履行其在本协议项下义务和符合法律规定的前提下，不对您的前述风险和损失承担任何责任。
<br />4.1.7 pk8平台PK币
<br />1.     “运营方”为pk8电竞在中华人民共和国（为本协议目的，不包括台湾、香港特别行政区和澳门特别行政区）内的独立且独家的运营方。运营方将提供游戏竞技、增值服务以及其他服务（合称为“虚拟服务”）。您可以通过现金或平台PK币购买虚拟服务；
<br />2.     开发了一套系统，命名为PK币，于pk8电竞客户端及相关增值业务内使用。您可通过平台充值或运营方认可的其他支付方式为您的pk8账户充入PK币。PK币可用于兑换虚拟服务。一旦成功充值，PK币将不得回兑成现金、预付费卡或其他形式予以退还，除非运营方另行明确同意或者适用的法律法规另有明确要求。您确认并同意PK币仅可用来兑换运营方提供的虚拟服务，且已充入pk8账户的PK币不得与其他pk8账户进行交易。如果您违反本条规定进行交易，运营方有权采取处理措施。您确认并同意运营方有权根据业务需要，独立决定开发、激活或停用PK币可适用的某些功能和服务；
<br />3.     一旦购买虚拟服务完成，无论是以现金还是通过兑换PK币进行的购买，您将不得撤销或要求将虚拟服务回兑成相应的现金或PK币，除非有证据证明是在您的账号被盗或者欺诈后进行的；
<br />4.     除用户自行填写的注册资料及用户充值的游戏币外，其它由本公司视相关功能或统计或增强游戏娱乐性之需要而生成的游戏数据，其所有权由本公司享有。
<br />4.1.8   社区比赛
为了支持本地的电子竞技比赛活动，在此提供有限的、可撤回的授权，您有权组织并主持某款游戏的小型社区赛事或系列比赛（“社区比赛”），并接受下列条件的约束：
<br />1.     每一社区所发的奖励由举办方发放，与技术提供方无关；
<br />2.     您不得向任何观看社区比赛的观众收取任何形式的费用；
<br />3.     社区比赛不得由公司赞助并售卖或推销下列物品：色情（或极端成人素材）、酒、烟草、枪械、竞争对手的线上电脑游戏、赌博网站、或不利于pk8业务的或与业务相竞争的任何公司（作弊、虚拟物品服务、帐号买卖、密钥销售商）；
<br />4.     社区比赛必须符合所有适用的法律规定；
<br />5.     社区比赛规则必须促进游戏的公平性，即社区的比赛中游戏技能是决定胜负的唯一因素。
<br />4.2服务规范
pk8电竞账户的所有权归您所有，您完成登录手续后，获得pk8电竞账户的使用权，该使用权仅属于初始申请注册人。您有义务妥善保管使用pk8电竞时的账户及密码，并为此组账户及密码登入系统后所开始的一连串行为或活动负责。鉴于网络服务的特殊性，pk8电竞不审核是否为您本人使用该组账户及密码，仅审核账户及密码是否与数据库中保存的一致，只要任何人输入的账户及密码与数据库中保存的一致，即可凭借该组账户及密码登陆pk8电竞。若使用者并非账户初始申请注册人，pk8电竞有权在未经通知的情况下冻结该账户且无需向该账户使用人承担任何法律责任，由此导致的包括并不限于您通讯中断、用户资料和虚拟道具等清空等损失由您自行承担。若账户的归属出现争议的，pk8电竞在收到相关方的投诉后，有权暂时冻结该争议账户；争议各方在合理举证期限内提供证据证明账户归属，pk8电竞依据各方提供的证据判断归属后，解冻争议账户。
您可通过pk8电竞服务在pk8电竞上传、发布或传输相关内容，包括但不限于文字、图形、图片、声音、音乐、视频、音视频、链接等不侵犯他人知识产权或其他合法权益的信息或其他资料（下称“内容”），但您需对此内容承担相关的法律责任。
除非有相反证明，pk8电竞将您视为您在pk8电竞上传、发布或传输的内容的版权拥有人。您使用pk8电竞服务上传、发布或传输内容即代表了您有权且同意，将您在pk8电竞上传发布或传输的全部内容（包括但不限于视频、音频，及与本协议事项相关的任何文字、视频、音频等，以下统称“大神成果”）的全部知识产权（包括但不限于著作权、商标权等知识产权以及相关的一切衍生权利）及相关权益，自上传、发布或传输之日起即转让给pk8电竞享有。协议期内及协议期满后，pk8电竞可以任何方式使用大神成果并享有相应的收益，未经pk8电竞事先书面同意，您不得自行或提供、授权給任何第三方以任何方式使用（包括但不限于在视频平台、游戏直播平台、游戏网站等其他任何第三方平台发布）及获得任何收益。
为方便您使用pk8电竞和pk8电竞关联公司的其他相关服务，您授权pk8电竞将您在账户注册和使用pk8电竞服务过程中提供、形成的信息传递给pk8电竞关联公司等其他相关服务提供者，或从pk8电竞关联公司等其他相关服务提供者获取您在登录、使用相关服务期间提供、形成的信息。
如您在征得pk8电竞同意情况下利用pk8电竞实施推广等商业行为和营销内容的，您必须在国家相关法律法规及pk8电竞关于推广等商业行为规范的基础上进行。您的商业行为和营销内容，必须本着平等、公平原则进行合理竞争，必须本真着真实准确原则进行合理推广，必须本着保护用户体验原则选择合理的推广方式及营销内容。如您进行恶意竞争，或采取虚假的商业行为、发布虚假夸大的营销内容，或发布频繁的、低质量的营销类信息，或您发布国家相关法规明令禁止的广告内容、违规开展商业行为等，pk8电竞有权将其内容的传播范围、传播对象作出限制，限制或禁止您使用pk8电竞全部或部分服务、注销账户以及依据法律法规保存有关信息并向有关部门报告等。 您在pk8电竞中与他人进行的商业行为引发的法律纠纷，由交易双方自行处理，pk8电竞不承担任何责任。
您理解并知晓在使用pk8电竞服务时，所接触的内容和信息来源广泛，pk8电竞无法对该内容和信息的准确性、真实性、可用性、安全性、完整性和正当性负责。您理解并认可您可能会接触到不正确的、令人不快的、不适当的或令人厌恶的内容和信息，您不会以此追究pk8电竞的相关责任。但pk8电竞有权依法停止传输任何前述内容并采取相应处理，包括但不限于暂停您继续使用pk8电竞的部分或全部服务，保存有关记录并向有关机关报告。
如您发布新闻信息，你理解并确认您具备互联网新闻信息服务资质，发布的新闻信息真实准确、客观公正。转载新闻信息应当完整准确，不得歪曲新闻信息内容，并在显著位置注明来源，保证新闻信息来源可追溯。pk8电竞有权审核你发布的新闻信息，如您发布不实新闻或您不具备发布资质，pk8电竞有权将您发布内容的传播范围、传播对象作出限制，限制或禁止您使用pk8电竞全部或部分服务、冻结账户以及依据法律法规保存有关信息并向有关部门报告等。
pk8电竞不对您在pk8电竞上传、发布或传输的任何内容和信息背书、推荐或表达观点，也不对任何内容和信息的错误、瑕疵及产生的损失或损害承担任何责任，您对内容和信息的任何使用需自行承担相关的风险。
您同意pk8电竞在提供服务的过程中以各种方式投放商业性广告或其他任何类型的商业信息（包括但不限于在pk8电竞的任何位置上投放广告，在您上传、传播的内容中投放广告），您同意接受pk8电竞通过电子邮件、站内消息、手机短信、网站公告或其他方式向您发送促销或其他相关商业信息。同时，pk8电竞有权在平台内添加网站logo（或名称）和时间的水印标志。pk8电竞将尽力但不保证不影响您的陪玩以及购买体验。
您应当自行约束您在pk8电竞上的用户行为，保证自己在线接单过程中的人身安全及财产安全。如您在pk8电竞网站外的场所或地域，因您自身原因、不可抗力或意外事件或第三方原因造成的人身及财产损失，由您自行承担。
使用pk8电竞服务过程中，您需遵守以下法律法规：《中华人民共和国保守国家秘密法》、《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《信息网络传播权保护条例》、等有关计算机及互联网规定的法律、法规。在任何情况下，pk8电竞一旦合理地认为您的行为可能违反上述法律、法规，可以在任何时候，不经事先通知终止向您提供服务。
<br />4.3禁止的内容
<br />您理解并保证您在pk8电竞制作、上传、发布或传输的内容（包括您的账户名称、评论等信息）不含有以下内容：
<br />（一）  反对宪法确定的基本原则的；
<br />（二）  危害国家统一、主权和领土完整，颠覆国家政权的；
<br />（三）  泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；
<br />（四）  煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
<br />（五）  破坏国家宗教政策，宣扬邪教、迷信的；
<br />（六）  扰乱社会秩序，破坏社会稳定的；
<br />（七）  诱导未成年人违法犯罪和渲染及传播淫秽、色情、赌博、暴力、凶杀、恐怖活动或者教唆犯罪的；
<br />（八）  侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；
<br />（九）  散布谣言，危害社会公德，损害民族优秀文化传统的；
<br />（十）  有关法律、行政法规和国家规定禁止的其他内容。
<br />如果您上传、发布或传输的内容含有以上违反法律法规的信息或内容的，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。如因此给pk8电竞造成不利后果的，您应负责消除影响，并且赔偿pk8电竞因此导致的一切损失，包括且不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。
<br />4.4禁止的行为
<br />您理解并保证不就pk8电竞服务进行下列的禁止的行为，也不允许任何人利用您的账户进行下列行为：
<br />1)     在登录账户时，或使用pk8电竞服务（包括但不限于上传、发布、传播信息等）时，冒充他人或机构，或您讹称与任何人或实体有联系（包括设置失实的账户名称或接入另一用户的账户），或您恶意使用账户导致其他用户误认；
<br />2)     伪造标题或以其他方式操控内容，使他人误认为该内容为pk8电竞所传输；
<br />3) 将无权传输的内容（例如内部资料、机密资料、侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容等）进行上传、发布、发送电子邮件或以其他方式传输；
<br />4) 上传、张贴、发送电子邮件或以其他方式传送任何未获邀约或未经授权的“垃圾电邮”、广告或宣传资料、促销资料，或任何其他商业通讯；
<br />5) 未经pk8电竞明确许可，使用pk8电竞服务用于任何商业用途或为任何第三方的利益；
<br />6) 跟踪或以其他方式骚扰他人；
<br />7) 参与任何非法或有可能非法（由pk8电竞判断）的活动或交易，包括传授犯罪方法、出售任何非法药物、洗钱活动、诈骗等；
<br />8) 赌博、提供赌博数据或透过任何方法诱使他人参与赌博活动；
<br />9) 使用或利用pk8电竞知识产权（包括pk8电竞的商标、品牌、标志、任何其他专有数据或任何网页的布局或设计），或在其他方面侵犯pk8电竞任何知识产权（包括试图对pk8电竞客户端或所使用的软件进行逆向工程）；
<br />10) 通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具，接入pk8电竞服务、收集或处理通过pk8电竞服务所提供的内容；
<br />11) 参与任何“框架”、“镜像”或其他技术，目的是模仿pk8电竞服务的外观和功能；
<br />12) 干预或试图干预任何用户或任何其他方接入pk8电竞服务；
<br />13) 故意散播含有干扰、破坏或限制计算机软件、硬件或通讯设备功能、pk8电竞服务、与pk8电竞服务相连的服务器和网络的病毒、网络蠕虫、特洛伊木马病毒、已损毁的档案或其他恶意代码或项目等资料；
<br />14) 未经他人明确同意，分享或发布该等人士可识别个人身份的资料；
<br />15) 探究或测试pk8电竞服务、系统或其他用户的系统是否容易入侵攻击，或在其他方面规避（或试图规避）pk8电竞服务、系统或其他用户的系统的任何安全功能；
<br />16) 对pk8电竞服务所用的软件进行解编、反向编译或逆向工程，或试图作出上述事项；
<br />17) 为破坏或滥用的目的开设多个账户，或恶意上传重复的、无效的大容量数据和信息；
<br />18）进行任何破坏pk8电竞服务公平性或者其他影响应用正常秩序的行为，如主动或被动刷分、合伙作弊、使用外挂或者其他的作弊软件、利用BUG（又叫“漏洞”或者“缺陷”）来获得不正当的非法利益，或者利用互联网或其他方式将外挂、作弊软件、BUG公之于众；
<br />19）进行任何诸如发布广告、销售商品的商业行为，或者进行任何非法的侵害pk8电竞利益的行为，如贩卖pk8电竞平台金额等虚拟产品、外挂等；
<br />20）通过任何渠道或媒体（包括但不限于自媒体等）发出“与pk8电竞合作”、“与pk8电竞共同出品”等任何携带“pk8电竞”品牌的字样，如您宣传推广合作节目，您只能在宣传中提及节目本身而不得提及与pk8电竞关系或者擅自以pk8电竞品牌进行推广，凡是您的发稿带有“pk8电竞”的一切宣传稿件必须通过pk8电竞相应合作部门之书面同意，否则因此给pk8电竞造成的一切损失您应予以赔偿；
<br />21) 故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范。
您可以在使用pk8电竞服务过程中购买商品、陪玩等虚拟产品增值服务。若无特殊说明，您通过在pk8电竞及其他pk8电竞授权的合法渠道上获得的金额、服务等虚拟产品，具体使用方法、期限等以pk8电竞页面中附带的说明及用户指南或具备以上解说性质的类似官方文档为准。虚拟产品会因用户需求、网站策略调整、用户接受程度等因素随时进行调整，具体信息请以当时的页面说明为准。
基于虚拟产品的性质和特征，pk8电竞不提供虚拟产品的退货、换货服务。如您消耗所获得的全部虚拟产品，且不将继续使用虚拟产品服务的，则该服务终止。
您应遵守本协议的各项条款，正确、适当地使用本服务，不得扰乱pk8电竞秩序，包括但不限于扰乱pk8电竞金融秩序（如恶意刷单等）。需要特别注意的是，如您涉嫌使用不合理手段充值（包括但不限于非法使用信用卡套现）的账号，pk8电竞有权依合理判断将您的账户暂时或永久冻结。
任何用户都应通过正规渠道获得pk8电竞上的陪玩服务以及虚拟货币，一切通过非官方公布渠道取得的虚拟产品及其衍生服务均不对pk8电竞发生法律效力，pk8电竞有权单方面收回相关虚拟产品并终止相应服务，严重者pk8电竞有权对中止或终止您使用pk8电竞全部或部分服务、冻结账户以及依据法律法规保存有关信息并向有关部门报告等。
<br />5、隐私权政策
pk8电竞非常重视用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，在您使用pk8电竞提供的服务时，您同意pk8电竞按照在pk8电竞上公布的隐私权政策收集、存储、使用、披露和保护您的个人信息。pk8电竞希望通过隐私权政策向您清楚地介绍pk8电竞对您个人信息的处理方式，因此pk8电竞建议您完整地阅读隐私权政策，以帮助您更好地保护您的隐私权。
如您对本隐私权政策有任何疑问，您可以通过pk8电竞公布的联系方式与pk8电竞联系。如果您不同意本隐私权政策任何内容，您应立即停止使用pk8电竞服务。当您使用pk8电竞提供的任一服务时，即表示您已同意pk8电竞按照本隐私权政策来合法使用和保护您的个人信息。
<br />5.1   适用范围
本隐私权政策适用于pk8电竞提供的所有服务，您访问pk8电竞网站及/或登录相关客户端使用pk8电竞提供的服务，均适用本隐私权政策。需要特别说明的是，本隐私权政策不适用于其他第三方向您提供的服务，例如pk8电竞上的第三方依托pk8电竞向您提供服务时，您向第三方提供的个人信息不适用于本隐私权政策，pk8电竞对任何第三方使用由您提供的信息不承担任何责任。
pk8电竞将遵循由中国广告协会互动网络分会颁布的《中国互联网定向广告用户信息保护框架标准》、工业和信息化部发布的《电信和互联网用户个人信息保护规定》以及《全国人大常委会关于加强网络信息保护的决定》，基于合法、合理和诚实信用的法定原则妥善处理或使用您的个人信息。
<br />5.2   pk8电竞如何收集信息
<br />pk8电竞收集信息是为了向您提供更好、更优、更个性化的服务，pk8电竞收集信息的方式如下：
<br />1)     您向pk8电竞提供的信息。
<br />当您登录pk8电竞账户及您在使用pk8电竞提供的相关服务时填写及/或提交的信息，包括您的姓名、性别、出生年月日、身份证号码、电话号码、电子邮箱、地址、兴趣爱好、支付账户及相关附加信息（如您所在的省份和城市、邮政编码等）。
您使用pk8电竞服务时所储存的信息。
<br />2) 在您使用服务过程中收集的信息。
<br />为了提供并优化您需要的服务，pk8电竞会收集您使用服务的相关信息，这类信息包括：
<br />在您使用pk8电竞服务时，如您下载或使用pk8电竞或其关联公司客户端软件，或访问移动网页使用pk8电竞服务时，pk8电竞可能会读取与您位置和移动设备相关的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。
<br />在您使用pk8电竞相关功能时，记录您的cookie、游戏缓存及浏览习惯。
<br />您通过pk8电竞的内容上传服务所上传的内容所包含的信息，例如拍摄或上传的共享照片或录像的日期、时间或地点等。
<br />除上述信息外，pk8电竞还可能为了提供服务及改进服务质量的合理需要而收集您的其他信息，包括您与pk8电竞的客户服务团队联系时您提供的相关信息，您参与问卷调查时向pk8电竞发送的问卷答复信息，以及您与pk8电竞的关联方、pk8电竞合作伙伴之间互动时pk8电竞收集的相关信息。与此同时，为提高您使用pk8电竞提供的服务的安全性，更准确地预防钓鱼欺诈和木马病毒，pk8电竞可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些pk8电竞认为有风险的URL。
<br />3) 来自第三方的信息。
<br />为了给您提供更好、更优、更加个性化的服务，或共同为您提供服务，或为了预防互联网欺诈的目的，pk8电竞的关联方、合作伙伴会依据法律的规定或与您的约定或征得您同意的前提下，向pk8电竞分享您的个人信息。
<br />您了解并同意，以下信息不适用本隐私权政策：
<br />a) 您在使用pk8电竞提供的搜索服务时输入的关键字信息；
<br />b) 违反法律规定或违反pk8电竞规则行为及pk8电竞已对您采取的措施；
<br />c) 应法律法规要求需披露的个人信息；
<br />d) 紧急情况下，为维护用户及公众的利益。
<br />5.3   pk8电竞如何使用信息
<br />因收集您的信息是为了向您提供服务及提升服务质量的目的，为了实现这一目的，pk8电竞会把您的信息用于下列用途：
<br />1)     向您提供您使用的各项服务，并设计、维护、改进这些服务。如电竞服务及战绩查询等功能；
<br />2)     向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或者在征得您同意的情况下与pk8电竞的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息；
<br />3)     向您提供与您更加相关的广告以替代普遍投放的广告；
<br />4)pk8电竞可能使用您的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与pk8电竞或其关联方协议、政策或规则的行为，以保护您、其他pk8电竞用户，或pk8电竞或其关联方的合法权益；
<br />5)pk8电竞可能会将来自某项服务的个人信息与来自其他服务的信息结合起来，用于为了给您提供更加个性化的服务使用，例如让您拥有更广泛的社交圈的需要而使用、共享或披露；
<br />6) 让您参与有关pk8电竞产品和服务的调查，或者促销及抽奖活动；
<br />7) 经您许可的其他用途。
<br />5.4 pk8电竞如何共享信息
<br />pk8电竞对您的信息承担保密义务，不会出售或出租您的任何信息，pk8电竞会在下列情况下才将您的信息与第三方共享：
<br />1) 事先获得您的同意或授权；
<br />2) 根据法律法规的规定或行政或司法机构的要求；
<br />3) 向pk8电竞的关联方分享您的个人信息；
<br />4) 向可信赖的合作伙伴提供您的个人信息，让他们根据pk8电竞的指示并遵循pk8电竞的隐私权政策以及其他任何相应的保密和安全措施来为pk8电竞处理这些信息；
<br />5) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
<br />6) 只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。例如您在pk8电竞上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，pk8电竞会视情况向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决；
<br />7) 如您出现违反中国有关法律、法规或者pk8电竞相关协议或相关规则的情况，需要向第三方披露；
<br />8) 为维护pk8电竞及其关联方或用户的合法权益。
<br />
<br />5.5 信息存储
<br />pk8电竞收集的有关您的信息和资料将保存在pk8电竞及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或pk8电竞收集信息和资料所在地并在该地被访问、存储和展示。
<br />5.6 您的个人信息保护
<br />为保障您的信息安全，pk8电竞努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。pk8电竞对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。pk8电竞会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，pk8电竞将尽力做到使您的信息不被泄漏、毁损或丢失。为保障您的信息安全，pk8电竞努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。pk8电竞对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。pk8电竞会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，pk8电竞将尽力做到使您的信息不被泄漏、毁损或丢失。
您的账户均有安全保护功能，请妥善保管您的账户及密码信息。pk8电竞将通过向其它服务器备份、对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您理解在信息网络上不存在“完善的安全措施”。
在使用pk8电竞服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如银行账户信息、联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请您立即联络pk8电竞客服，以便pk8电竞采取相应措施。
<br />5.7 未成年人保护
<br />pk8电竞不会在知情的情况下收集未成年人的个人信息。除非所在地法律允许并且监护人同意，未成年人请不要注册账户或发送自己的姓名、住址、电话、邮件地址等个人信息给pk8电竞。如果pk8电竞不小心收集到了未成年人的信息，pk8电竞在知情后会尽快删除。如果您认为pk8电竞可能不当地持有来自于或关于未成年人的信息，请联系pk8电竞。
<br />6、第三方链接
<br />pk8电竞服务可能会包含与其他网站或资源的链接。pk8电竞对于前述网站或资源的内容、隐私政策和活动，无权控制、审查或修改，因而也不承担任何责任。pk8电竞建议您在离开pk8电竞，访问其他网站或资源前仔细阅读其服务条款和隐私政策。
<br />7、知识产权
<br />除非另有约定或pk8电竞另行声明，pk8电竞内的所有内容（用户依法享有版权的内容除外）、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利，均归pk8电竞或pk8电竞关联公司所有。未经pk8电竞许可，任何人不得擅自使用（包括但不限于复制、传播、展示、镜像、上载、下载、修改、出租）。
pk8电竞的Logo、“pk8”、“pk8电竞”、“pk8电竞平台”、“pk8”、“pk8电竞”、“pk8电竞平台”等文字、图形及其组合，以及pk8电竞的其他标识、徵记、产品和服务名称均为pk8电竞或pk8电竞关联公司在中国或其它国家的商标，未经pk8电竞书面授权，任何人不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用或作其他处理。
pk8电竞对pk8电竞专有内容、原创内容和其他通过授权取得的独占或独家内容享有完全知识产权。未经pk8电竞许可，任何单位和个人不得私自转载、传播和提供观看服务或者有其他侵犯pk8电竞知识产权的行为，否则将承担包括侵权等所有相关的法律责任。
<br />8、用户的违约及处理
<br />8.1 违约认定
<br />发生如下情形之一的，视为您违约：
<br />（一）使用pk8电竞服务时违反有关法律法规规定的；
<br />（二）违反本协议或本协议补充协议（即本协议第2.2条）约定的。
<br />为适应互联网行业发展和满足海量用户对高效优质服务的需求，您理解并同意，pk8电竞可在pk8电竞规则中约定违约认定的程序和标准。如：pk8电竞可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。
<br />8.2 违约处理措施
<br />您在pk8电竞上发布的内容和信息构成违约的，pk8电竞可根据相应规则立即对相应内容和信息进行删除、屏蔽等处理或对您的账户进行暂停使用、查封、冻结或清空虚拟商品等处理。
<br />您在pk8电竞上实施的行为，或虽未在pk8电竞上实施但对pk8电竞及其用户产生影响的行为构成违约的，pk8电竞可依据相应规则对您的账户执行限制参加活动、中止向您提供部分或全部服务（如查封虚拟陪玩房间、冻结或清空虚拟商品、扣划违约金等）处理措施。如您的行为构成根本违约的，pk8电竞可冻结您的账户，终止向您提供服务。如您扥账户被冻结，您账户内的平台金额等虚拟产品将被冻结，相关虚拟产品服务将被终止提供。
<br />如果您在pk8电竞上的行为违反相关的法律法规，pk8电竞可依法向相关主管机关报告并提交您的使用记录和其他信息。同时，pk8电竞可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在pk8电竞上予以公示。除此之外，pk8电竞可依据国家相关法律法规规定，对您进行黑名单管理和信用管理，提供与信用等级挂钩的管理和服务，若您被纳入黑名单，有权对纳入黑名单的您采取禁止重新登录账号的措施，并及时向相关部门报告。
<br />8.3赔偿责任
<br />如您的行为使pk8电竞及/或其关联公司遭受损失（包括但不限于自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿pk8电竞及/或其关联公司的上述全部损失。
<br />如您的行为使pk8电竞鱼及/或其关联公司遭受第三人主张权利，pk8电竞及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。
<br />8.4特别约定
<br />如您向pk8电竞及/或其关联公司的雇员或顾问等提供实物、现金、现金等价物、劳务、旅游等价值明显超出正常商务洽谈范畴的利益，则可视为您存在商业贿赂行为。发生上述情形的，pk8电竞可立即终止与您的所有合作并向您收取违约金及/或赔偿金，该等金额以pk8电竞因您的贿赂行为而遭受的经济损失和商誉损失作为计算依据。
pk8电竞负责"按现状"和"可得到"的状态向您提供pk8电竞服务。pk8电竞依法律规定承担相应义务，但无法对由于信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，黑客活动、计算机病毒、电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或因第三方原因而给您造成的损害结果承担责任。
pk8电竞通过中华人民共和国境内的设施控制和提供pk8电竞服务，pk8电竞不担保控制或提供的服务在其他国家或地区是适当的、可行的，任何在其他司法辖区使用pk8电竞服务的用户应自行确保其遵守当地的法律法规，pk8电竞对此不承担任何责任。
<br />9、协议的变更
<br />pk8电竞可根据国家法律法规变化及pk8电竞服务变化的需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过本协议第10条约定的方式通知您。更新后的协议条款一旦公布即代替原来的协议条款。
如您对变更事项不同意的，您应当于变更事项确定的生效之日起停止使用pk8电竞服务；如您在变更事项生效后仍继续使用pk8电竞服务，则视为您同意已生效的变更事项。
<br />10、通知
<br />您同意pk8电竞以以下合理的方式向您送达各类通知：
<br />（一）公示的文案；
<br />（二）站内消息、弹出消息、客户端推送的消息；
<br />（三）根据您预留于pk8电竞的联系方式发出的电子邮件、手机短信、函件等。
<br />pk8电竞通过上述方式向您发出通知，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。 对于在pk8电竞上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱等联系方式为您在pk8电竞登录、更新时提供的手机号码、电子邮箱联系方式，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。
您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。
您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。
你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。
<br />11、协议的终止
<br />11.1 终止的情形
<br />您有权通过以下任一方式终止本协议：
<br />（一）在满足pk8电竞网站公示的账户注销等清理条件时您通过网站注销您的账户的；
<br />（二）变更事项生效前您停止使用并明示不愿接受变更事项的；
<br />（三）您明示不愿继续使用pk8电竞服务，且符合pk8电竞终止条件的。
<br />出现以下情况时，pk8电竞可以本协议第10条的所列的方式通知您中止或终止本协议：
<br />（一）您违反本协议约定，pk8电竞依据违约条款终止本协议的
<br />（二）您转让本人账户、盗用他人账户、提供虚假登录身份信息、发布违禁内容和信息、骗取他人财物、采取不正当手段谋利等行为，pk8电竞依据pk8电竞规则对您的账户予以永久冻结的；
<br />（三）除上述情形外，因您多次违反pk8电竞规则相关规定且情节严重，pk8电竞依据pk8电竞规则对您的账户予以冻结的；
<br />（四）您的账户被pk8电竞依据本协议进行冻结等清理的；
<br />（五）您在pk8电竞有侵犯他人合法权益或其他严重违法违约行为的；
<br />（六）其它根据相关法律法规pk8电竞应当终止服务的情况。
<br />11.2 协议终止后的处理
<br />本协议终止后，除法律有明确规定外，pk8电竞无义务向您或您指定的第三方披露您账户中的任何信息。
<br />本协议终止后，pk8电竞享有下列权利：
<br />（一）停止收集和使用您的个人信息，但可继续保存您留存于pk8电竞的其他内容和信息；
<br />（二）对于您过往的违约行为，pk8电竞仍可依据本协议向您追究违约责任。
<br />12、法律适用、管辖与其他
<br />本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。
<br />您因使用pk8电竞服务所产生及与pk8电竞服务有关的争议，由pk8电竞与您协商解决。协商不成时，任何一方均可向人民法院提起诉讼。
<br />本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</span>
            </div>
            <div class="rr_btn" @click="AgreementUpsuc">确 定</div>
        </el-dialog>
    </div>
</template>
<script>
export default {
    props: {
        value: Boolean,
        agreementNmae:String,
    },
    data() {
        return {

        };
    },
    computed: {
        isTosignupsuc: {
            get() {
                return this.value
            },
            set(v) {
                this.$emit('input', v)
            }
        }
    },
    methods: {
        AgreementUpsuc(){
            this.$emit('LoginBiniphonesuc',true)
            this.isTosignupsuc=false
        }
    }
}
</script>
<style>
.AgreementUp .el-dialog {
  height: 440px;
  background: #121212;
  border: solid 1px #4c4c4c;
}
.AgreementUp .el-dialog__headerbtn .el-dialog__close {
  position: absolute;
  /* top: -10px; */
  right: -5px;
}
.AgreementUp .el-dialog__header {
  padding: 0;
}
.AgreementUp .el-dialog__body {
  height: 404px;
  padding: 0px 20px 20px 20px;
  text-align: center;
}
.AgreementUp .rr_title {
  height: 14px;
  margin-bottom: 40px;
  line-height: 14px;
  font-size: 14px;
  color: #8d8c8d;
}
.AgreementUp .rr_btn {
  width: 320px;
  height: 40px;
  background-color: #7800ff;
  margin: auto;
  text-align: center;
  line-height: 40px;
  font-size: 16px;
  color: #fefefe;
  cursor: pointer;
  margin-top: 20px;
}
.AgreementUp p {
  font-size: 18px;
  font-weight: normal;
  font-stretch: normal;
  color: #ffffff;
}
.AgreementUp span {
  font-size: 14px;
  font-weight: normal;
  font-stretch: normal;
  color: #8d8c8d;
}
</style>
<style lang='less' scoped>
.AgreementUp{
    .main-content{
        width: 320px;
        height: 280px;
        background-color: #373739;
        border: solid 1px #4c4c4c;
        margin: auto;
        span{
            width: 294px;
            height: 264px;
            display: block;
            margin: 8px auto;
            font-family: SourceHanSansCN-Regular;
            text-align: left;
            font-size: 14px;
            font-weight: normal;
            font-stretch: normal;
            line-height: 16px;
            letter-spacing: 0px;
            color: #ffffff;
            overflow: auto;
            text-indent:25px;
            -ms-overflow-style:none
        }
        ::-webkit-scrollbar{
            display: none;
        }
    }
}
</style>
